simmsb/tyrfing/vendor/avr-device/svd/attiny2313a.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Atmel</vendor>
  <name>ATtiny2313A</name>
  <version>1.0</version>
  <description>No description available.</description>
  <cpu>
    <name>other</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>8</width>
  <size>0x8</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x000000FF</resetMask>
  <peripherals>
    <peripheral>
      <name>AC</name>
      <description>Analog Comparator</description>
      <baseAddress>0x00000021</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACSR</name>
          <description>Analog Comparator Control And Status Register</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACIS</name>
              <description>Analog Comparator Interrupt Mode Select bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Interrupt on Toggle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Reserved</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Interrupt on Falling Edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Interrupt on Rising Edge</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACIC</name>
              <description>No Description.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACIE</name>
              <description>Analog Comparator Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACI</name>
              <description>Analog Comparator Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACO</name>
              <description>Analog Compare Output</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACBG</name>
              <description>Analog Comparator Bandgap Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACD</name>
              <description>Analog Comparator Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR</name>
          <description>Digital Input Disable Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x00000026</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1D</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2B</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x31</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x37</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Reset, Power-on Reset and Watchdog Reset</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>INT1</name>
        <description>External Interrupt Request 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>USART_RX</name>
        <description>USART, Rx Complete</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>USART_UDRE</name>
        <description>USART Data Register Empty</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>USART_TX</name>
        <description>USART, Tx Complete</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>ANA_COMP</name>
        <description>Analog Comparator</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>PCINT_B</name>
        <description>Pin Change Interrupt Request B</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>No Description.</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPA</name>
        <description>No Description.</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPB</name>
        <description>No Description.</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>USI_START</name>
        <description>USI Start Condition</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>USI_OVERFLOW</name>
        <description>USI Overflow</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>EEPROM_Ready</name>
        <description>No Description.</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>WDT_OVERFLOW</name>
        <description>Watchdog Timer Overflow</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>PCINT_A</name>
        <description>Pin Change Interrupt Request A</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>PCINT_D</name>
        <description>Pin Change Interrupt Request D</description>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>BODCR</name>
          <description>BOD control register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BPDSE</name>
              <description>No Description.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BPDS</name>
              <description>No Description.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKPR</name>
          <description>Clock Prescale Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x08</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>Clock Prescaler Change Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General Purpose I/O Register 0</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose I/O Register 1</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose I/O Register 2</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GTCCR</name>
          <description>General Timer Counter Control Register</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSR10</name>
              <description>No Description.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>Interrupt Sense Control 0 bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Any Logical Change in INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>Interrupt Sense Control 1 bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Any Logical Change in INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select Bits</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN2</name>
                  <description>Power Down</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down </description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull-up Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status register</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-On Reset Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Register</description>
          <addressOffset>0x2B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR</name>
          <description>Power reduction register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRUSART</name>
              <description>No Description.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRUSI</name>
              <description>No Description.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM</name>
              <description>No Description.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPL</name>
          <description>Stack Pointer Low Byte</description>
          <addressOffset>0x37</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control and Status register</description>
          <addressOffset>0x31</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store Program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFLB</name>
              <description>Read Fuse and Lock Bits</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTPB</name>
              <description>Clear Temporary Page Buffer</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
