simmsb/tyrfing/vendor/avr-device/svd/attiny2313a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>No Description.</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELFPRGEN</name>
              <description>Self Programming enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>No Description.</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSTDISBL</name>
              <description>External reset disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>Brown-out detection at VCC=4.3 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection at VCC=2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>Brown-out detection at VCC=1.8 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Brown-out detection disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watch-dog Timer always on</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWEN</name>
              <description>Debug Wire enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock Source</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_14CK_0MS</name>
                  <description>Ext. Clock; Start-up time: 14 CK + 0   ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_4MHZ_14CK_0MS</name>
                  <description>Int. RC Osc. 4 MHz; Start-up time: 14 CK + 0   ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_14CK_0MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time: 14 CK + 0   ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_128KHZ_14CK_0MS</name>
                  <description>Int. RC Osc. 128 kHz; Start-up time: 14 CK + 0 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_14CK_4MS1</name>
                  <description>Ext. Clock; Start-up time: 14 CK + 4.1 ms</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_4MHZ_14CK_4MS1</name>
                  <description>Int. RC Osc. 4 MHz; Start-up time: 14 CK + 4.1 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_14CK_4MS1</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time: 14 CK + 4.1 ms</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_128KHZ_14CK_4MS</name>
                  <description>Int. RC Osc. 128 kHz; Start-up time: 14 CK + 4 ms</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 0 ms</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 0 ms</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 0 ms</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 0 ms</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_14CK_65MS</name>
                  <description>Ext. Clock; Start-up time: 14 CK + 65  ms</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_4MHZ_14CK_65MS</name>
                  <description>Int. RC Osc. 4 MHz; Start-up time: 14 CK + 65  ms</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_14CK_65MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65  ms</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_128KHZ_14CK_64MS</name>
                  <description>Int. RC Osc. 128 kHz; Start-up time: 14 CK + 64 ms</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 4.1 ms</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 4.1 ms</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 4.1 ms</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 4.1 ms</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time: 14 CK + 65 ms</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time: 14 CK + 65 ms</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time: 14 CK + 65 ms</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time: 14 CK + 65 ms</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTD2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
