simmsb/tyrfing/vendor/avr-device/svd/attiny2313a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <description>Timer/Counter, 8-bit</description>
      <baseAddress>0x00000050</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OCR0A</name>
          <description>Timer/Counter0 Output Compare Register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR0B</name>
          <description>Timer/Counter0 Output Compare Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR0A</name>
          <description>Timer/Counter  Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM0</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM0B</name>
              <description>Compare Match Output B Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>COM0A</name>
              <description>Compare Match Output A Mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0B</name>
          <description>Timer/Counter Control Register B</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS0</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Running, CLK/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Running, CLK/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Running, CLK/256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Running, CLK/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>Running, ExtClk Tx Falling Edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Running, ExtClk Tx Rising Edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM02</name>
              <description>No Description.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC0B</name>
              <description>Force Output Compare B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC0A</name>
              <description>Force Output Compare B</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT0</name>
          <description>Timer/Counter0</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR</name>
          <description>Timer/Counter Interrupt Flag register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCF0A</name>
              <description>Timer/Counter0 Output Compare Flag 0A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOV0</name>
              <description>Timer/Counter0 Overflow Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF0B</name>
              <description>Timer/Counter0 Output Compare Flag 0B</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK</name>
          <description>Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCIE0A</name>
              <description>Timer/Counter0 Output Compare Match A Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TOIE0</name>
              <description>Timer/Counter0 Overflow Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE0B</name>
              <description>Timer/Counter0 Output Compare Match B Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
